packages/inductiva/inductiva-0.0.31-py3-none-any.whl/inductiva/templates/heat_sink/openfoam/files/system/volAvgFinTemperature
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out the maximum cell value for one or more fields.

\*---------------------------------------------------------------------------*/


type            volFieldValue;
libs            ("libfieldFunctionObjects.so");
log             true;
//writeControl    timeStep;//writeTime;//timeStep;//writeTime;
writeFields     false;
regionType      all;//cellZone;
region          fins;
name            fins;
operation       volAverage;
weightField     none;//alpha1;
fields
(
    T
);

// ************************************************************************* //
